package com.example.collection.singleLinkedList;

/**
 * Создай класс `MyLinkedList`, который реализует основные операции односвязного списка,
 * такие как добавление, удаление, поиск и вывод элементов.
 * Обрати внимание на то, что `MyLinkedList` должен поддерживать следующие операции:
 * 1. **Добавление элемента в конец списка.**
 * 2. **Удаление элемента по значению.**
 * 3. **Поиск элемента по значению.**
 * 4. **Вывод всех элементов списка.**
 * - В классе `MyLinkedList` должны быть следующие методы:
 *     - `void add(int value)` – добавляет элемент в конец списка.
 *     - `boolean remove(int value)` – удаляет первый встреченный элемент со значением `value`.
 *          Возвращает `true`, если элемент был удален, и `false` в противном случае.
 *     - `boolean contains(int value)` – возвращает `true`, если список содержит элемент со значением `value`, в противном случае `false`.
 *     - `void printList()` – выводит все элементы списка на консоль.
 */
public class Main {

    public static void main(String[] args) {

    }
}
